PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_lpcomp.c
/*******************************************************************************
* \file cy_lpcomp.c
* \version 1.80.1
*
* \brief
*  This file provides the driver code to the API for the Low Power Comparator
*  component.
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXLPCOMP) || defined (CY_IP_MXS22LPCOMP) || defined (CY_IP_MXS40LPCOMP)

#include "cy_lpcomp.h"

#if defined(__cplusplus)
extern "C" {
#endif


#if defined (CY_IP_MXS22LPCOMP)
#include "cy_systrimm.h"

/* Start trimming data for COMP_CH0 */
#define TRIMM_START_IDX_COMP_CH0                                                                (90UL)
/* Start trimming data for COMP_CH1 */
#define TRIMM_START_IDX_COMP_CH1                                                                (91UL)

/* Forward declarations */
#if !defined (CY_AUTANALOG_TRIMM_DISABLE)
static cy_en_lpcomp_status_t LPComp_LoadTrimmValues(LPCOMP_Type *base, cy_en_lpcomp_channel_t channel);
#endif
#endif /* CY_IP_MXS22LPCOMP */

/*******************************************************************************
* Function Name: Cy_LPComp_Init_Ext
****************************************************************************//**
*
* Cy_LPComp_Init_Ext() is an extended version of existing function Cy_LPComp_Init().
* This implementation follows the thread-safe approach and is preferable for usage.
*
* This function initializes the low-power comparator and returns
* the status of the initialization.
*
* \note Interrupt edge-detect mode and drive power mode are not written to the registers
* during the function execution. This can result in unexpected interrupts
* when the comparator is enabled. Instead, the configurations are saved to the
* context and applied in the \ref Cy_LPComp_Enable_Ext() function.
*
* \param *base
*     The low-power comparator registers structure pointer.
*
* \param channel
*     The low-power comparator channel index.
*
* \param *config
*     The pointer to the configuration structure for PDL.
*
* \param *context
* The pointer to the context structure \ref cy_stc_lpcomp_context_t allocated by the user.
* The structure is used during the low-power comparator operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return cy_en_lpcomp_status_t
*     *base checking result. If the pointer is NULL, returns an error.
*
*******************************************************************************/
cy_en_lpcomp_status_t Cy_LPComp_Init_Ext(LPCOMP_Type *base, cy_en_lpcomp_channel_t channel, const cy_stc_lpcomp_config_t *config,
        cy_stc_lpcomp_context_t *context)
{
    cy_en_lpcomp_status_t ret = CY_LPCOMP_BAD_PARAM;

    if ((base != NULL) && (config != NULL) && (context != NULL))
    {
        CY_ASSERT_L3(CY_LPCOMP_IS_CHANNEL_VALID(channel));
        CY_ASSERT_L3(CY_LPCOMP_IS_OUT_MODE_VALID(config->outputMode));
        CY_ASSERT_L3(CY_LPCOMP_IS_HYSTERESIS_VALID(config->hysteresis));
        CY_ASSERT_L3(CY_LPCOMP_IS_POWER_VALID(config->power));
        CY_ASSERT_L3(CY_LPCOMP_IS_INTR_MODE_VALID(config->intType));

        Cy_LPComp_GlobalEnable(base);

        if (CY_LPCOMP_CHANNEL_0 == channel)
        {
            LPCOMP_CMP0_CTRL(base) = _VAL2FLD(LPCOMP_CMP0_CTRL_HYST0, (uint32_t)config->hysteresis) |
                                     _VAL2FLD(LPCOMP_CMP0_CTRL_DSI_BYPASS0, (uint32_t)config->outputMode) |
                                     _VAL2FLD(LPCOMP_CMP0_CTRL_DSI_LEVEL0, (uint32_t)config->outputMode >> 1u);
        }
        else
        {
            LPCOMP_CMP1_CTRL(base) = _VAL2FLD(LPCOMP_CMP1_CTRL_HYST1, (uint32_t)config->hysteresis) |
                                     _VAL2FLD(LPCOMP_CMP1_CTRL_DSI_BYPASS1, (uint32_t)config->outputMode) |
                                     _VAL2FLD(LPCOMP_CMP1_CTRL_DSI_LEVEL1, (uint32_t)config->outputMode >> 1u);
        }

        /* Save intType to use it in the Cy_LPComp_Enable_Ext() function */
        context->intType[(uint8_t)channel - 1u] = config->intType;

        /* Save power to use it in the Cy_LPComp_Enable_Ext() function */
        context->power[(uint8_t)channel - 1u] = config->power;

#if defined (CY_IP_MXS22LPCOMP)
        /* Read and apply trimming values */
#if !defined (CY_AUTANALOG_TRIMM_DISABLE)
        ret = LPComp_LoadTrimmValues(base, channel);
#else
        ret = CY_LPCOMP_SUCCESS;
#endif
#else
        ret = CY_LPCOMP_SUCCESS;
#endif /* CY_IP_MXS22LPCOMP */

    }

    return (ret);
}




/*******************************************************************************
* Function Name: Cy_LPComp_Enable_Ext
****************************************************************************//**
*
* Cy_LPComp_Enable_Ext() is an extended version of existing function Cy_LPComp_Enable().
* This implementation follows the thread-safe approach and is preferable for usage.
*
* This function enables the low-power comparator and sets
* interrupt edge-detect and drive power modes.
*
* \param *base
*     The low-power comparator register structure pointer.
*
* \param channel
*     The low-power comparator channel index.
*
* \param *context
* The pointer to the context structure \ref cy_stc_lpcomp_context_t allocated by the user.
* The structure is used during the low-power comparator operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return None.
*
*******************************************************************************/
void Cy_LPComp_Enable_Ext(LPCOMP_Type* base, cy_en_lpcomp_channel_t channel, cy_stc_lpcomp_context_t *context)
{
    cy_en_lpcomp_pwr_t powerSpeed;

    CY_ASSERT_L3(CY_LPCOMP_IS_CHANNEL_VALID(channel));

