PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_lpcomp.c
    powerSpeed = context->power[(uint8_t)channel - 1u];

    /* Set power */
    Cy_LPComp_SetPower_Ext(base, channel, powerSpeed, context);

    /* Make delay before enabling the comparator interrupt to prevent false triggering */
    if (CY_LPCOMP_MODE_ULP == powerSpeed)
    {
        Cy_SysLib_DelayUs(CY_LPCOMP_ULP_POWER_DELAY);
    }
    else if (CY_LPCOMP_MODE_LP == powerSpeed)
    {
        Cy_SysLib_DelayUs(CY_LPCOMP_LP_POWER_DELAY);
    }
    else
    {
        Cy_SysLib_DelayUs(CY_LPCOMP_NORMAL_POWER_DELAY);
    }

    /* Enable the comparator interrupt */
    Cy_LPComp_SetInterruptTriggerMode_Ext(base, channel, context->intType[(uint8_t)channel - 1u], context);
}



/*******************************************************************************
* Function Name: Cy_LPComp_Disable_Ext
****************************************************************************//**
*
* Cy_LPComp_Disable_Ext() is an extended version of existing function Cy_LPComp_Disable().
* This implementation follows the thread-safe approach and is preferable for usage.
*
* This function disables the low-power comparator power and sets interrupt edge-detect mode
* to the disabled state.
*
* \note This function disables the comparator interrupt to prevent a false trigger
* that may happen due to stop working of the comparator unpowered output. \n
*
* \note Disabled states for comparator interrupt and drive power are not preserved in the context.
* The actual configurations for interrupt edge-detect and drive power
* are restored from the context in: \ref Cy_LPComp_Enable_Ext().
*
* \param *base
*     The low-power comparator register structure pointer.
*
* \param channel
*     The low-power comparator channel index.
*
* \param *context
* The pointer to the context structure \ref cy_stc_lpcomp_context_t allocated by the user.
* The structure is used during the low-power comparator operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return None.
*
*******************************************************************************/
void Cy_LPComp_Disable_Ext(LPCOMP_Type* base, cy_en_lpcomp_channel_t channel, cy_stc_lpcomp_context_t *context)
{
    CY_ASSERT_L3(CY_LPCOMP_IS_CHANNEL_VALID(channel));

    /* Disable the comparator interrupt */
    Cy_LPComp_SetInterruptTriggerMode_Ext(base, channel, CY_LPCOMP_INTR_DISABLE, context);

    /* Set power off */
    Cy_LPComp_SetPower_Ext(base, channel, CY_LPCOMP_MODE_OFF, context);
}



/*******************************************************************************
* Function Name: Cy_LPComp_SetInterruptTriggerMode_Ext
****************************************************************************//**
*
* Cy_LPComp_SetInterruptTriggerMode_Ext() is an extended version of existing function
* Cy_LPComp_SetInterruptTriggerMode().
* This implementation follows the thread-safe approach and is preferable for usage.
*
* This function sets the interrupt edge-detect mode and controls the value
* provided on the output.
*
* \note The interrupt edge-detect mode is preserved in the context,
* except state CY_LPCOMP_INTR_DISABLE. \n
*
* \note  The mode of the interrupt is restored after the block is enabled and appropriate
* start-up time has elapsed:
* * 3 us is for normal power mode;
* * 6 us for LP mode;
* * 50 us for ULP mode.
*
* \param *base
*     The low-power comparator register structure pointer.
*
* \param channel
*     The low-power comparator channel index.
*
* \param intType
*   Interrupt edge trigger selection:
*   * CY_LPCOMP_INTR_DISABLE (=0) - disabled, no interrupt will be detected;
*   * CY_LPCOMP_INTR_RISING  (=1) - the rising edge;
*   * CY_LPCOMP_INTR_FALLING (=2) - the falling edge;
*   * CY_LPCOMP_INTR_BOTH    (=3) - both rising and falling edges.
*
* \param *context
* The pointer to the context structure \ref cy_stc_lpcomp_context_t allocated by the user.
* The structure is used during the low-power comparator operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return None.
*
*******************************************************************************/
void Cy_LPComp_SetInterruptTriggerMode_Ext(LPCOMP_Type* base, cy_en_lpcomp_channel_t channel, cy_en_lpcomp_int_t intType,
        cy_stc_lpcomp_context_t *context)
{
    CY_ASSERT_L3(CY_LPCOMP_IS_CHANNEL_VALID(channel));
    CY_ASSERT_L3(CY_LPCOMP_IS_INTR_MODE_VALID(intType));

    if (CY_LPCOMP_CHANNEL_0 == channel)
    {
        LPCOMP_CMP0_CTRL(base) = _CLR_SET_FLD32U(LPCOMP_CMP0_CTRL(base), LPCOMP_CMP0_CTRL_INTTYPE0, (uint32_t)intType);
    }
    else
    {
        LPCOMP_CMP1_CTRL(base) = _CLR_SET_FLD32U(LPCOMP_CMP1_CTRL(base), LPCOMP_CMP1_CTRL_INTTYPE1, (uint32_t)intType);
    }

    /* Save interrupt type to use it in the Cy_LPComp_Enable_Ext() function */
    if (intType != CY_LPCOMP_INTR_DISABLE)
    {
        context->intType[(uint8_t)channel - 1u] = intType;
    }
}



/*******************************************************************************
* Function Name: Cy_LPComp_SetPower_Ext
****************************************************************************//**
*
* Cy_LPComp_SetPower_Ext() is an extended version of existing function Cy_LPComp_SetPower().
* This implementation follows the thread-safe approach and is preferable for usage.
*
* This function sets the drive power and speeds to one of the four settings.
*
* \note The drive power mode is preserved in the context,
* except state CY_LPCOMP_MODE_OFF. \n
*
* \note  The mode of the interrupt is restored after the block is enabled and appropriate
* start-up time has elapsed:
* * 3 us for normal power mode;
* * 6 us for LP mode;
* * 50 us for ULP mode.
* Otherwise, unexpected interrupts can occur.
*
* \param *base
*     The low-power comparator register structure pointer.
*
* \param channel
*     The low-power comparator channel index.
*
* \param power
*     Defines the component power mode:
*     * CY_LPCOMP_OFF_POWER   (=0) - off power;
*     * CY_LPCOMP_MODE_ULP    (=1) - slow/ultra low power;
*     * CY_LPCOMP_MODE_LP     (=2) - medium/low power;
*     * CY_LPCOMP_MODE_NORMAL (=3) - fast/normal power.
*
* \param *context
* The pointer to the context structure \ref cy_stc_lpcomp_context_t allocated by the user.
* The structure is used during the low-power comparator operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return None.
*
*******************************************************************************/
void Cy_LPComp_SetPower_Ext(LPCOMP_Type* base, cy_en_lpcomp_channel_t channel, cy_en_lpcomp_pwr_t power,
                            cy_stc_lpcomp_context_t *context)
{
    CY_ASSERT_L3(CY_LPCOMP_IS_CHANNEL_VALID(channel));
    CY_ASSERT_L3(CY_LPCOMP_IS_POWER_VALID(power));

    if (CY_LPCOMP_CHANNEL_0 == channel)
    {
        LPCOMP_CMP0_CTRL(base) = _CLR_SET_FLD32U(LPCOMP_CMP0_CTRL(base), LPCOMP_CMP0_CTRL_MODE0, (uint32_t)power);
    }
    else
    {
        LPCOMP_CMP1_CTRL(base) = _CLR_SET_FLD32U(LPCOMP_CMP1_CTRL(base), LPCOMP_CMP1_CTRL_MODE1, (uint32_t)power);
    }

    /* Save power to use it in the Cy_LPComp_Enable_Ext() function */
    if (power != CY_LPCOMP_MODE_OFF)
    {
        context->power[(uint8_t)channel - 1u] = power;
    }
}




