PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_lpcomp.c
/*******************************************************************************
* Function Name: Cy_LPComp_DeepSleepCallback
****************************************************************************//**
*
* This function checks the current low-power comparator power mode and disables
* the low-power comparator block, if there is no wake-up source from
* the low-power comparator in Deep-Sleep mode.
* This function stores the state of the low-power comparator "Enable", disables
* the low-power comparator block before going to low power modes and then
* recovers the low-power comparator power "after a wake-up" state using
* the stored value.
*
* \param *callbackParams
*     A \ref cy_stc_syspm_callback_params_t structure with callback
*     parameters that consists of mode, base and context fields:
*    *base - a low-power comparator register structure pointer.
*    *context - context for the call-back function.
*     mode
*     * CY_SYSPM_CHECK_READY - no action for this state.
*     * CY_SYSPM_CHECK_FAIL - no action for this state.
*     * CY_SYSPM_BEFORE_TRANSITION - checks the low-power comparator interrupt mask
*                            and power mode and then disables or enables the
*                            low-power comparator block per condition.
*                            Stores the low-power comparator state
*                            to recover the state after a wake up.
*     * CY_SYSPM_AFTER_TRANSITION - enables the low-power comparator block
*                            if it was disabled before Sleep mode.
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
*******************************************************************************/
cy_en_syspm_status_t Cy_LPComp_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t ret = CY_SYSPM_FAIL;
    LPCOMP_Type *locBase = (LPCOMP_Type *)(callbackParams->base);
    static uint32_t enabled_status;

    switch (mode)
    {
    case CY_SYSPM_CHECK_READY:
    {
        ret = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_CHECK_FAIL:
    {
        ret = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_BEFORE_TRANSITION:
    {
        /* Save the low-power comparator the enabled/disabled status. */
        enabled_status = _FLD2VAL(LPCOMP_CONFIG_ENABLED, LPCOMP_CONFIG(locBase));

        if (0u != enabled_status)
        {
            /* Disable the low-power comparator block when there is no wake-up source from any channel. */
            if (!(((_FLD2VAL(LPCOMP_CMP0_CTRL_MODE0, LPCOMP_CMP0_CTRL(locBase)) == (uint32_t)CY_LPCOMP_MODE_ULP) &&
                    _FLD2BOOL(LPCOMP_INTR_MASK_COMP0_MASK, LPCOMP_INTR_MASK(locBase))) ||
                    ((_FLD2VAL(LPCOMP_CMP1_CTRL_MODE1, LPCOMP_CMP1_CTRL(locBase)) == (uint32_t)CY_LPCOMP_MODE_ULP) &&
                     _FLD2BOOL(LPCOMP_INTR_MASK_COMP1_MASK, LPCOMP_INTR_MASK(locBase)))))

            {
                /* Disable the low-power comparator block to avoid leakage. */
                Cy_LPComp_GlobalDisable(locBase);
            }
            else
            {
                /* Set low-power comparator the status to the not changed state. */
                enabled_status = 0u;
            }
        }
        else
        {
            /* The low-power comparator block was already disabled and
            *  the system is allowed to go to the low power mode.
            */
        }

        ret = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_AFTER_TRANSITION:
    {
        /* Enable the low-power comparator to operate if it was enabled
        * before entering to the low power mode.
        */
        if (0u != enabled_status)
        {
            Cy_LPComp_GlobalEnable(locBase);
        }
        else
        {
            /* The low-power comparator block was disabled before calling this API
            * with mode = CY_SYSPM_CHECK_READY.
            */
        }

        ret = CY_SYSPM_SUCCESS;
    }
    break;

    default:
        /* Unknown state */
        break;
    }

    return (ret);
}


/*******************************************************************************
* Function Name: Cy_LPComp_HibernateCallback
****************************************************************************//**
*
*  This function checks the current low-power comparator power mode and disables
* the low-power comparator block, if there is no wake-up source from
* the low-power comparator in Hibernate mode.
*
* \param *callbackParams
*     A \ref cy_stc_syspm_callback_params_t structure with callback
*     parameters that consists of mode, base and context fields:
*    *base - a low-power comparator register structure pointer.
*    *context - context for the call-back function.
*     mode
*     * CY_SYSPM_CHECK_READY - no action for this state.
*     * CY_SYSPM_CHECK_FAIL - no action for this state.
*     * CY_SYSPM_BEFORE_TRANSITION - checks the wake-up source from Hibernate mode
*                            of the low-power comparator block,
*                            and then disables or enables the low-power comparator
*                            block per condition.
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
*******************************************************************************/
cy_en_syspm_status_t Cy_LPComp_HibernateCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t ret = CY_SYSPM_FAIL;
    LPCOMP_Type *locBase = (LPCOMP_Type *)(callbackParams->base);
    static uint32_t enabled_status;

    switch (mode)
    {
    case CY_SYSPM_CHECK_READY:
    {
        ret = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_CHECK_FAIL:
    {
        ret = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_BEFORE_TRANSITION:
    {
        /* Save the low-power comparator the enabled/disabled status. */
        enabled_status = _FLD2VAL(LPCOMP_CONFIG_ENABLED, LPCOMP_CONFIG(locBase));

