PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_lpcomp.c
        if (0u != enabled_status)
        {
            /* Disable the low-power comparator block when there is no wake-up source from any channel. */
            if (!(((_FLD2VAL(LPCOMP_CMP0_CTRL_MODE0, LPCOMP_CMP0_CTRL(locBase)) == (uint32_t)CY_LPCOMP_MODE_ULP) &&
#if defined (CY_IP_MXS22LPCOMP) || defined (CY_IP_MXS40LPCOMP)
                    _FLD2BOOL(CY_LPCOMP_WAKEUP_PIN0, SRSS_PWR_HIB_WAKE_CTL)) ||
#else
                    _FLD2BOOL(CY_LPCOMP_WAKEUP_PIN0, SRSS_PWR_HIBERNATE)) ||
#endif
                    ((_FLD2VAL(LPCOMP_CMP1_CTRL_MODE1, LPCOMP_CMP1_CTRL(locBase)) == (uint32_t)CY_LPCOMP_MODE_ULP) &&

#if defined (CY_IP_MXS22LPCOMP) || defined (CY_IP_MXS40LPCOMP)
                     _FLD2BOOL(CY_LPCOMP_WAKEUP_PIN1, SRSS_PWR_HIB_WAKE_CTL))))
#else
                     _FLD2BOOL(CY_LPCOMP_WAKEUP_PIN1, SRSS_PWR_HIBERNATE))))
#endif
            {
                /* Disable the low-power comparator block to avoid leakage. */
                Cy_LPComp_GlobalDisable(locBase);
            }
            else
            {
                /* Set low-power comparator the status to the not changed state. */
                enabled_status = 0u;
            }
        }
        else
        {
            /* The low-power comparator block was already disabled and
            *  the system is allowed to go to the low power mode.
            */
        }

        ret = CY_SYSPM_SUCCESS;
    }
    break;

    default:
        /* Unknown state */
        break;
    }

    return (ret);
}


#if defined (CY_IP_MXS22LPCOMP)
/*******************************************************************************
* Function Name: Cy_LPComp_GetTrim
****************************************************************************//**
*
* This function returns current trim settings for a particular channel of
* low-power comparator.
*
* \param *base
*     The low-power comparator register structure pointer.
*
* \param channel
*     The low-power comparator channel index.
*
* \param *trim
*     The low-power comparator trim structure pointer, see \ref cy_en_lpcomp_trim_t.
*
* \return None.
*
*******************************************************************************/
void Cy_LPComp_GetTrim(LPCOMP_Type const * base, cy_en_lpcomp_channel_t channel, cy_en_lpcomp_trim_t * trim)
{
    CY_ASSERT_L3(CY_LPCOMP_IS_CHANNEL_VALID(channel));

    if (CY_LPCOMP_CHANNEL_0 == channel)
    {
        trim->enable = _FLD2BOOL(LPCOMP_CMP0_OFFSET_TRIM_CMP0_EN, LPCOMP_CMP0_OFFSET_TRIM(base));
        CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 2, 'Intentional typecast of uint32_t to enum')
        trim->polarity = (cy_en_lpcomp_trim_polarity_t)_FLD2VAL(LPCOMP_CMP0_OFFSET_TRIM_CMP0_POLARITY, LPCOMP_CMP0_OFFSET_TRIM(base));
        trim->magnitude = (cy_en_lpcomp_trim_magnitude_t)_FLD2VAL(LPCOMP_CMP0_OFFSET_TRIM_CMP0_MAGNITUDE, LPCOMP_CMP0_OFFSET_TRIM(base));
        CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8')
    }
    else
    {
        trim->enable = _FLD2BOOL(LPCOMP_CMP1_OFFSET_TRIM_CMP1_EN, LPCOMP_CMP1_OFFSET_TRIM(base));
        CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 2, 'Intentional typecast of uint32_t to enum')
        trim->polarity = (cy_en_lpcomp_trim_polarity_t)_FLD2VAL(LPCOMP_CMP1_OFFSET_TRIM_CMP1_POLARITY, LPCOMP_CMP1_OFFSET_TRIM(base));
        trim->magnitude = (cy_en_lpcomp_trim_magnitude_t)_FLD2VAL(LPCOMP_CMP1_OFFSET_TRIM_CMP1_MAGNITUDE, LPCOMP_CMP1_OFFSET_TRIM(base));
        CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8')
    }
}


/*******************************************************************************
* Function Name: Cy_LPComp_SetTrim
****************************************************************************//**
*
* This function applies trim settings to the particular channel of
* low-power comparator.
*
* \param *base
*     The low-power comparator register structure pointer.
*
* \param channel
*     The low-power comparator channel index.
*
* \param *trim
*     The low-power comparator trim structure pointer, see \ref cy_en_lpcomp_trim_t.
*
* \return None.
*
*******************************************************************************/
void Cy_LPComp_SetTrim(LPCOMP_Type * base, cy_en_lpcomp_channel_t channel, const cy_en_lpcomp_trim_t * trim)
{
    CY_ASSERT_L3(CY_LPCOMP_IS_CHANNEL_VALID(channel));
    CY_ASSERT_L3(CY_LPCOMP_IS_TRIM_VALID(trim));

    if (CY_LPCOMP_CHANNEL_0 == channel)
    {
        LPCOMP_CMP0_OFFSET_TRIM(base) = _BOOL2FLD(LPCOMP_CMP0_OFFSET_TRIM_CMP0_EN,        trim->enable) |
                                        _VAL2FLD(LPCOMP_CMP0_OFFSET_TRIM_CMP0_POLARITY,  trim->polarity) |
                                        _VAL2FLD(LPCOMP_CMP0_OFFSET_TRIM_CMP0_MAGNITUDE, trim->magnitude);
    }
    else
    {
        LPCOMP_CMP1_OFFSET_TRIM(base) = _BOOL2FLD(LPCOMP_CMP1_OFFSET_TRIM_CMP1_EN,        trim->enable) |
                                        _VAL2FLD(LPCOMP_CMP1_OFFSET_TRIM_CMP1_POLARITY,  trim->polarity) |
                                        _VAL2FLD(LPCOMP_CMP1_OFFSET_TRIM_CMP1_MAGNITUDE, trim->magnitude);
    }
}


#if !defined (CY_AUTANALOG_TRIMM_DISABLE)
/*******************************************************************************
* Function Name: LPComp_LoadTrimmValues
****************************************************************************//**
*
* Used to load trimming values from RRAM into MMIO for further use at runtime.
*
* \param *base
*     The low-power comparator registers structure pointer.
*
* \param channel
*     The low-power comparator channel index.
*
* \return
* Status of operation, \ref cy_en_lpcomp_status_t.
*
*******************************************************************************/
static cy_en_lpcomp_status_t LPComp_LoadTrimmValues(LPCOMP_Type *base, cy_en_lpcomp_channel_t channel)
{
    cy_en_lpcomp_status_t ret = CY_LPCOMP_TRIMM_ERR;

    uint32_t trimmData[TRIMM_SECTION_SIZE_BYTES / sizeof(int)];

    /* Read array of trimming constants */
    if (Cy_Trimm_ReadRRAMdata(TRIMM_SECTION_SIZE_BYTES, trimmData))
    {
        ret = CY_LPCOMP_SUCCESS;

        if (CY_LPCOMP_CHANNEL_0 == channel)
        {
            LPCOMP_CMP0_OFFSET_TRIM(base) = trimmData[TRIMM_START_IDX_COMP_CH0];
        }
        else
        {
            LPCOMP_CMP1_OFFSET_TRIM(base) = trimmData[TRIMM_START_IDX_COMP_CH1];
        }
    }

    return ret;
}
#endif

#endif /* CY_IP_MXS22LPCOMP */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXLPCOMP, CY_IP_MXS22LPCOMP, and CY_IP_MXS40LPCOMP */

/* [] END OF FILE */
